import pickle


def crc_dict_list(p):
    if type(p) == list:
        print(p)
        p_l = list(filter(lambda i: type(i) == int, p))
        print(p_l)
        if p_l:
            return max(p_l) * min(p_l)
        else:
            return 0
    elif type(p) == dict:
        return sum(filter(lambda i: type(i) == int, p))


if __name__ == '__main__':
    data = [1, 'c', 1, [1, 2, '3'], 'f', (1, 2, 4, 5, 7), {'a', 'f', 'h', 1}]
    with open('data.pkl', 'wb') as file:
        pickle.dump(data, file)

    # p_name, res_crc = input(), int(input())
    p_name, res_crc = 'data.pkl', 0
    c = ' не'
    with open(p_name, 'rb') as p:
        if crc_dict_list(pickle.load(p)) == res_crc:
            c = ''
    print(f'Контрольные суммы{c} совпадают')


# data2 = {'30': 900, 7.7: 5929, '7.1': 5041, 11: 121, 7.8: 6084, 6: '36', 49: 2401, 51: 2601, 96: 9216, 80: 6400,
#          (53, 21): 441, 68: 4624, 3: 9, 42: 1764, 20: 400, 87: 7569, 39: 1521, 1: 1, 4: 16, 31: 961, 29: 841, 28: 784,
#          (45, 16, 37): 1369, 18: '324', '26': 676, 15: 225, 36: 1296, 22: 484, 27: 729, 47: 2209, 95: 9025, 32: 1024,
#          8.2: 6724, 2.3: 529, 7.5: 5625, 40: 1600, 84: 7056, 91: 8281, '43': 1849, 8.9: 79.21, 5: 25, 12: '144', 7: 49,
#          25: 625, 67: 4489, 94: 8836, 88: 7744, 93: 8649, '85': '7225', 90: 8100, 7.9: 6241, 24: 576, 81: 6561,
#          83: 6889, 2: 4, 34: 1156, 1.3: 169, '62': '3844', 9: 81, 14: 196, 7.3: 5.329, 63: [3969, 4096, 9604], 55: 3025,
#          44: 1936, 5.6: 3136, '74': 5476, 97: 9409, 46: 2116, 65: 4225, 92: 8464, 99: 9801, 38: 1444, 58: 3364, 0: 0,
#          59: 3481, 8: 64, 35: 1225, '57': '3249', 52: '2704', 19: 361, 76: 5776, 41: 1681, 72: 5184, 50: 2500, 61: 3721,
#          66: 4356, 17: 289, 60: 3600, 33: 1089, '86': 7396, '48': 2304, 10: 100, 54: 2916, '70': 4900, 69: 4761}
# data3 = ['a', 'c', 'c', [1, 2, '3'], 'f', (1, 2, 4, 5, 7), {'a', 'f', 'h', 1}]
#
# with open('data.pkl', 'wb') as file:
#     pickle.dump(data, file)
#
# with open('data2.pkl', 'wb') as file:
#     pickle.dump(data2, file)
#
# with open('data3.pkl', 'wb') as file:
#     pickle.dump(data3, file)